Model: "real2comic"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d_28 (Conv2D)          (None, 512, 512, 3)       84        
                                                                 
 conv2d_29 (Conv2D)          (None, 512, 512, 32)      896       
                                                                 
 max_pooling2d_12 (MaxPooli  (None, 256, 256, 32)      0         
 ng2D)                                                           
                                                                 
 conv2d_30 (Conv2D)          (None, 256, 256, 64)      18496     
                                                                 
 conv2d_31 (Conv2D)          (None, 256, 256, 64)      36928     
                                                                 
 max_pooling2d_13 (MaxPooli  (None, 128, 128, 64)      0         
 ng2D)                                                           
                                                                 
 conv2d_32 (Conv2D)          (None, 128, 128, 128)     73856     
                                                                 
 conv2d_33 (Conv2D)          (None, 128, 128, 128)     147584    
                                                                 
 max_pooling2d_14 (MaxPooli  (None, 64, 64, 128)       0         
 ng2D)                                                           
                                                                 
 conv2d_34 (Conv2D)          (None, 64, 64, 128)       147584    
                                                                 
 conv2d_transpose_7 (Conv2D  (None, 64, 64, 128)       147584    
 Transpose)                                                      
                                                                 
 conv2d_transpose_8 (Conv2D  (None, 128, 128, 128)     147584    
 Transpose)                                                      
                                                                 
 conv2d_transpose_9 (Conv2D  (None, 256, 256, 64)      73792     
 Transpose)                                                      
                                                                 
 conv2d_transpose_10 (Conv2  (None, 512, 512, 32)      18464     
 DTranspose)                                                     
                                                                 
 conv2d_transpose_11 (Conv2  (None, 512, 512, 3)       867       
 DTranspose)                                                     
                                                                 
=================================================================
Total params: 813719 (3.10 MB)
Trainable params: 813719 (3.10 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
